<?php
	
	$g_lgt=array(
        array("192.168.1.24",9001),  // 本机
		/*
        array("192.168.1.60",9001),  
        array("192.168.1.5",9001),   
        array("192.168.1.253",9001), 
        array("192.168.1.122",9001), 
        array("192.168.1.126",9001), 
        array("192.168.1.49",9001),  
        array("192.168.1.23",9001),  
        array("192.168.1.41",9001),  
        array("192.168.1.16",9001),  
		*/
    );
	
    //srand(time()); //Note: 自 PHP 4.2.0 起，不再需要用 srand() 或 mt_srand() 给随机数发生器播种 ，因为现在是由系统自动完成的。
	$idx = rand(0, count($g_lgt)-1);
    $s = $g_lgt[$idx];
    echo $s[0] . "&" . strval($s[1]);
    
?>

